Autodesk.Revit.DB.Structure.IRebarInterfaceProxy.GetDefaultInteriorDirForSegment(Autodesk.Revit.DB.Structure.Rebar,System.Int32,System.Int32)
Returns the default interior segment's direction for the input rebar.
rebarTarget:
The rebar target.
barIndex:
The bar index for which the interior segment's direction is requested.
segmentIndex:
The segment indexes for which the interior segment's direction is requested.
Returns:
The default interior segment's dir.

Autodesk.Revit.DB.Structure.IRebarInterfaceProxy.SplitRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ISet{System.Int32},System.Boolean,System.Boolean)
This will split the rebar in two sets.
First will contain the bars from index 0 - barIndex, and the second one will contain the bars from barIndex+1 to NumberOfBarPositions.
document:
The document.
rebarToSplit:
The rebar that will be split
barIndices:
The array storing the indices of the initial bars from the rebar where the splits will occur.
constrainSplitSets:
If this is true, Rebar Plane handle of the second set will be constraint to the Out of Plane (or Rebar Plane if the layout is Single) handle of the first set. If it is false, it will be no constraint between the two resulted sets.
splitAllSetsInSpliceChain:
If this is true, all sets in the splice chain will be split and the splice relationships will be maintained. If it is false, only the selected set will be split and no splice relationship will be preserved.
Returns:
Returns the ids of the rebars that are considerred to be split.